sedfoam-master/tutorials/laminar/2DWetAvalanche/Reference1D/system/probe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


//functions
//{
//probes
//{
//// Where to load it from
//functionObjectLibs ( "libsampling.so" );

//type        probes;

//// Name of the directory for probe data
//name        probes;
//writeInterval   1;
//// Fields to be probed
//fields (
  ////      p_rbgh
    //    p
    ////    Ua
      ////  Ub
       //);

//probeLocations // Locations to be probed. runTime modifiable!
  //     (
    //    (-0.0138 -0.0481 0.0)
      //   ( 0.0138 -0.0481 0.0)
       //);
//}

//} 
 
